





















let bota ="гривень";
    
    





let buza={
    1:"сто",
    2:"двісті",
    3:"триста",
    4:"чотириста",
    5:"п'ятьсот",
    6:"шісот",
    7:"сімсот",
    8:"вісімсот",
    9:"дев'ятьсот",

}


let bezi ={
     1:"десять",
     3:"тридцять",
     2:"двадцять",
     4:"сорок",
     5:"п'ядесять",
     6:"шісдесять",
     7:"сімдесять",
     8:"вісімдесять",
     9:"дев'яносто",
     }

let  baza = {
    1:"одна гривня",
    2:"дві гривні",
    3:"три гривні",
    4:"чотири гривні",
    5:"п'ять гривень",
    6:"шість гривень",
    7:"сім гривень",
    8:"вісім гривень",
    9:"дев'ять гривень",
    
}
let bita = {
    1:"одинадцять гривень",
    2:"дванадцять гривень",
    3:"тринадцять гривень",
    4:"чотирнадцять гривень",
    5:"п'ятнадцять гривень",
    6:"шіснадцять гривень",
    7:"сімнадцять гривень",
    8:"вісімнадцять гривень",
    9:"дев'ятнадцять гривень",
}
let kupa;

let sum = prompt('');

let gr = sum.split('');


    if(gr <= 9){
        kupa =baza [gr[0]];
        console.log(`${kupa}`);
    }
    
        if(gr[0] > 1 && gr[1] >= 1 && gr[2] == undefined){
                  kupa = bezi[gr[0]]+' '+baza[gr[1]];
                  console.log(`${kupa}`);
               
             }
             if(gr[0] == 1 && gr[1] > 0 && gr[2] == undefined){
                kupa = bita[gr[1]];
                console.log(`${kupa}`)
             }
             if(gr[0] >= 1 && gr[1] == 0 && gr[2] == undefined){
                kupa = bezi[gr[0]];
                console.log(`${kupa} гривень`);
             }
             if(gr[0] >= 1 && gr[1] == 0 && gr[2] == 0){
                    kupa = buza[gr[0]];
                  console.log(`${kupa} гривень`);
             }
             if(gr[0] > 0 && gr[1] >= 1 && gr[2] == 0){
                     kupa = buza[gr[0]]+' '+bezi[gr[1]];
                    
                    console.log(`${kupa} гривень`);
                       
                 }
                 if((gr[0] > 0) && (gr[1] > 1) && (gr[2] > 0 && gr[3] == undefined)){
                        kupa = buza[gr[0]]+' '+bezi[gr[1]]+' '+baza[gr[2]];
                        
                         console.log(`${kupa}`);
                           
                     }
                     if((gr[0] > 0) && (gr[1] == 0) && (gr[2] > 0)){
                            kupa = buza[gr[0]]+' '+baza[gr[2]];
                            
                              console.log(`${kupa}`);
                               
                     }
                     if((gr[0] > 0) && (gr[1] == 1) && (gr[2] > 0)){
                             kupa = buza[gr[0]]+' '+bita[gr[2]];
                            
                              console.log(`${kupa}`);
                               
                         }
            
     

    





        